In [1]:
import pandas as pd

/tmp/ipykernel_25249/4080736814.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [2]:
#series
numbers = [3,4,5,6,7]
serie = pd.Series(numbers)
serie, type(serie)

(0    3
 1    4
 2    5
 3    6
 4    7
 dtype: int64,
 pandas.core.series.Series)

In [3]:
#dictionary
data = {
    "Name": ["Ana", "Juan", "Pedro"],
    "YearsOld": [25,23,21],
    "Citys": ["NY","LONDON", "New Zeland"]
}
data, type(data)

({'Name': ['Ana', 'Juan', 'Pedro'],
  'YearsOld': [25, 23, 21],
  'Citys': ['NY', 'LONDON', 'New Zeland']},
 dict)

In [4]:
#DataFrame
df = pd.DataFrame(data)
df

    Name  YearsOld       Citys
0    Ana        25          NY
1   Juan        23      LONDON
2  Pedro        21  New Zeland

In [5]:
#export df to csv
df.to_csv("data.csv")

In [6]:
#import csv, with index_col=0 don't create indice col
import_df = pd.read_csv("data.csv", index_col=0)
import_df

    Name  YearsOld       Citys
0    Ana        25          NY
1   Juan        23      LONDON
2  Pedro        21  New Zeland

In [7]:
#how to select column?
names = df["Name"]
print(names)

0      Ana
1     Juan
2    Pedro
Name: Name, dtype: object

In [8]:
#how to select more than one column?
df[["Name", "YearsOld"]]

    Name  YearsOld
0    Ana        25
1   Juan        23
2  Pedro        21

In [9]:
#filter with rows
fil = df.loc[1]
fil

Name          Juan
YearsOld        23
Citys       LONDON
Name: 1, dtype: object

In [10]:
#filter with condition
df[df["YearsOld"] > 22]

   Name  YearsOld   Citys
0   Ana        25      NY
1  Juan        23  LONDON

In [11]:
#filter with much conditions
filter = (df["YearsOld"] > 21) & (df["Name"].str.startswith("A"))
df[filter]

  Name  YearsOld Citys
0  Ana        25    NY

In [12]:
#Filter with sql querys
df.query("YearsOld > 22")

   Name  YearsOld   Citys
0   Ana        25      NY
1  Juan        23  LONDON

In [13]:
#Extract rows by explicit data cols
df[df["Name"].isin(["Calors","Ana","Pedro","Xavi"])]

    Name  YearsOld       Citys
0    Ana        25          NY
2  Pedro        21  New Zeland

In [14]:
#Filter with ranges
df[df["YearsOld"].between(23,26)]

   Name  YearsOld   Citys
0   Ana        25      NY
1  Juan        23  LONDON

In [15]:
#How to applicate functions with data?

def long_5(name):
    return len(name) == 5

df[df["Name"].apply(long_5)]

    Name  YearsOld       Citys
2  Pedro        21  New Zeland